app/views/main/index5.erb

SELECT COUNT(*) FROM "consults"
---
                      <img src="<%= image_path('nodongja_logo_w.png') %>">
                        <input style="display:none" value="<%=Consult.count %>" id="goso_count" type="number">