app/views/main/index2.erb

SELECT COUNT(*) FROM "consults"
---
                      <img src="<%= image_path('gosomi_logo_beta.png') %>">
                        <input style="display:none" value="<%=Consult.count %>" id="goso_count" type="number">