app/views/main/index4.erb

                      <img src="<%= image_path('gosomi_logo_beta.png') %>">
                        <input style="display:none" value="<%=Consult.count %>" id="goso_count" type="number">
---
SELECT COUNT(*) FROM "consults"