app/views/main/index.erb

              <img src="<%= image_path('nodongja_logo_w.png') %>">
                <input style="display:none" value="<%=Consult.count %>" id="goso_count" type="number">
---
SELECT COUNT(*) FROM "consults"