app/views/sue/show_test_test.erb

<link rel="stylesheet" href="/assets/button.css">
dbdb=Sueform.find(params[:id])%>
---
SELECT  "sueforms".* FROM "sueforms" WHERE "sueforms"."id" = ? LIMIT 1  [["id", nil]]