app/controllers/main_controller.rb

SELECT  "receives".* FROM "receives" LIMIT 10
SELECT  "celebrities".* FROM "celebrities"  ORDER BY count DESC LIMIT 10
SELECT COUNT(*) FROM "celebrities"
---
    def index_test


         @h = Hash.new
        uri = URI("https://search.naver.com/search.naver?sm=tab_hty.top&where=news&ie=utf8&query=%EC%95%85%ED%94%8C")
        page = Nokogiri::HTML(Net::HTTP.get(uri))
        page.xpath('//ul[@class="type01"]/li/dl/dt/a''[@href]').take(5).each do |link|
        @h[link.text.strip] = link['href']
        end
        if current_user.present?
        @c = Receive.where(:user_id => current_user.id)
        end
        a = Receive.take(10)
        @b = []
        a.reverse.each do |nick|
            if nick.you_nickname.to_s.length <= 3
                @b.push(nick.you_nickname[0..1] + "*"*(nick.you_nickname.to_s.length-2))
            elsif nick.you_nickname.to_s.length <= 6
                @b.push(nick.you_nickname[0..2] + "*"*(nick.you_nickname.to_s.length-3))
            elsif nick.you_nickname.to_s.length <= 15
                @b.push(nick.you_nickname[0..5] + "*"*(nick.you_nickname.to_s.length-6))
            end
        end
        @n = 1
        @celebrities = Celebrity.all.order("count DESC").limit(10)